{
  "id": "Hadran",
  "sections": [
    {
      "commentary": {},
      "en": "We will return to you, Tractate ____, and you will return to us; our mind is on you, Tractate ____, and your mind is on us; we will not forget you, Tractate ____, and you will not forget us – not in this world and not in the next world.",
      "he": "הֲדְרָן עֲלָךְ מַסֶּכֶת <small>(יאמר שם המסכת)</small> וְהֲדְרָךְ עֲלָן. דַּעְתָּן עֲלָךְ מַסֶּכֶת <small>(יאמר שם המסכת)</small> וְדַעְתָּךְ עֲלָן. לָא נִתְנְשֵׁי מִינָךְ מַסֶּכֶת <small>(יאמר שם המסכת)</small> וְלֹא תִתְנְשֵׁי מִינָן, לָא בְּעָלְמָא הָדֵין וְלֹא בְּעָלְמָא דְאַָתֵי:",
      "ref": "Hadran 1"
    },
    {
      "commentary": {},
      "en": "May it be Your will, our G-d, and the G-d of our fathers, that we should be loyal to Your Torah in this world, and it should be with us in the next world. Chaninah bar Pappa, Rami bar Pappa, Nachman bar Pappa, Achai bar Pappa, Aba bar Pappa, Rafram bar Pappa, Rachish bar Pappa, Sorchav bar Pappa, Ada bar Pappa, Daro bar Pappa.",
      "he": "יְהִי רָצוֹן מִלְּפָנֶיךָ יְיָ אֱלֹהֵינוּ וֶאֱלֹהֵי אֲבוֹתֵינוּ שֶׁתְּהֵא תּוֹרָתְךָ אֻמָּנוּתֵנוּ בָּעוֹלָם הַזֶּה וּתְהֵא עִמָּנוּ לָעוֹלָם הַבָּא. חֲנִינָא בַּר פָּפָּא, רָמִי בַּר פָּפָּא, נַחְמָן בַּר פָּפָּא, אַחַאי בַּר פָּפָּא, אַבָּא [מָרִי] בַּר פָּפָּא, רַפְרָם בַּר פָּפָּא, רָכִישׁ בַּר פָּפָּא, סוּרְחָב בַּר פָּפָּא, אַדָּא בַּר פָּפָּא, דָּרוּ בַּר פָּפָּא:",
      "ref": "Hadran 2"
    },
    {
      "commentary": {
        "Verses": {
          "comments": [
            {
              "en": "Your commandments make me wiser than my enemies;<br>they always stand by me.",
              "he": "מֵֽ֭אֹיְבַי תְּחַכְּמֵ֣נִי מִצְוֺתֶ֑ךָ כִּ֖י לְעוֹלָ֣ם הִיא־לִֽי׃",
              "link": "/Psalms/119",
              "ref": "Psalms 119:98",
              "sourceHeRef": "תהילים קיט:צח",
              "sourceRef": "Psalms 119:98"
            },
            {
              "en": "May I wholeheartedly follow Your laws<br>so that I do not come to grief.<br>",
              "he": "יְהִי־לִבִּ֣י תָמִ֣ים בְּחֻקֶּ֑יךָ לְ֝מַ֗עַן לֹ֣א אֵבֽוֹשׁ׃ <span class=\"mam-spi-pe\">{פ}</span><br>",
              "link": "/Psalms/119",
              "ref": "Psalms 119:80",
              "sourceHeRef": "תהילים קיט:פ",
              "sourceRef": "Psalms 119:80"
            },
            {
              "en": "I will never neglect Your precepts,<br>for You have preserved my life through them.",
              "he": "לְ֭עוֹלָם לֹא־אֶשְׁכַּ֣ח פִּקּוּדֶ֑יךָ כִּ֥י בָ֝֗ם חִיִּיתָֽנִי׃",
              "link": "/Psalms/119",
              "ref": "Psalms 119:93",
              "sourceHeRef": "תהילים קיט:צג",
              "sourceRef": "Psalms 119:93"
            },
            {
              "en": "Blessed are You, O L<small>ORD</small>;<br>train me in Your laws.",
              "he": "בָּר֖וּךְ אַתָּ֥ה יְהֹוָ֗ה לַמְּדֵ֥נִי חֻקֶּֽיךָ׃",
              "link": "/Psalms/119",
              "ref": "Psalms 119:12",
              "sourceHeRef": "תהילים קיט:יב",
              "sourceRef": "Psalms 119:12"
            }
          ]
        }
      },
      "en": "Please make it sweet, G-d our G-d, the words of Your Torah. In our mouths, and in the mouths of your nation the House of Israel. And it should be that we, all of us, our children and the children of your nation the House of Israel, that we should all know Your name and learn Your Torah. [Psalms 119:98] \"Your commandment makes me wiser than my enemies, for it is ever with me.\" [Psalms 119:80] \"Let my heart be complete in Your statutes, in order that I may not be put to shame.\" [Psalms 119:93] \"I will never forget Your precepts; for with them You have quickened me.\" [Psalms 119:12] \"Blessed are You O G-d, teach me Your statutes.\" (and forever)",
      "he": "הַעֲרֵב נָא יְיָ אֱלֹהֵינוּ, אֶת דִּבְרֵי תּוֹרָתְךָ בְּפִינוּ וּבְפִיפִיּוֹת עַמְּךָ בֵּית יִשְׂרָאֵל, וְנִהְיֶה כּוּלָנוּ אֲנַחְנוּ וְצֶאֱצָאֵינוּ (וְצֶאֱצָאֵי צֶאֱצָאֵינוּ) וְצֶאֱצָאֵי עַמְּךָ בֵּית יִשְׂרָאֵל, כּוּלָנוּ יוֹדְעֵי שְׁמֶךָ וְלוֹמְדֵי תּוֹרָתְךָ. מֵאֹיְבַי תְּחַכְּמֵנִי מִצְו‍ֹתֶךָ כִּי לְעוֹלָם הִיא לִי. יְהִי לִבִּי תָמִים בְּחֻקֶּיךָ לְמַעַן לֹא אֵבוֹש. לְעוֹלָם לֹא אֶשְׁכַּח פִּקּוּדֶיךָ כִּי בָם חִיִּיתָנִי. בָּרוּךְ אַתָּה יְיָ לַמֽדֵנִי חֻקֶּיךָ. אָמֵן אָמֵן אָמֵן סֶלָה וָעֶד:",
      "ref": "Hadran 3"
    },
    {
      "commentary": {
        "Verses": {
          "comments": [
            {
              "en": "For You, O God, will bring them down to the nethermost Pit—<br>those murderous, treacherous men;<br>they shall not live out half their days;<br>but I trust in You.",
              "he": "וְאַתָּ֤ה אֱלֹהִ֨ים <b>׀</b> תּוֹרִדֵ֬ם <span class=\"hebrew-emphasis\">׀</span> לִבְאֵ֬ר שַׁ֗חַת אַנְשֵׁ֤י דָמִ֣ים וּ֭מִרְמָה לֹא־יֶחֱצ֣וּ יְמֵיהֶ֑ם וַ֝אֲנִ֗י אֶבְטַח־בָּֽךְ׃ <span class=\"mam-spi-pe\">{פ}</span><br>",
              "link": "/Psalms/55",
              "ref": "Psalms 55:24",
              "sourceHeRef": "תהילים נה:כד",
              "sourceRef": "Psalms 55:24"
            }
          ]
        }
      },
      "en": "We give thanks before You, Lord, our G-d and G-d of our fathers, for you gave us a share among those who sit in the study hall, and not among those who sit on street corners. For we arise early, and they arise early; we arise for words of Torah, and they arise for words of emptiness. We work, and they work; we work and receive a reward, and they work and do not receive a reward. We run, and they run; we run towards eternal life, and they run to a pit of desolation. As it says: (Psalms 55:24) \"And You, O Lord, bring them down into a pit of desolation, people of blood and deceit will not live out half of their days; and I, I will trust in You.\"",
      "he": "מוֹדִים אֲנַחְנוּ לְּפָנֶיךָ יְיָ אֱלֹהֵינוּ וֶאֱלֹהֵי אַבוֹתֵינוּ שֶׁשַּׂמְתָּ חֶלְקֵנוּ מִיּוֹשְׁבֵי בֵּית הַמִּדְרָשׁ, וְלֹא שַׂמְתָּ חֶלְקֵנוּ מִיּוֹשְׁבֵי קְרָנוֹת. שֶׁאָנוּ מַשְׁכִּימִים וְהֵם מַשְׁכִּימִים. אָנוּ מַשְׁכִּימִים לְדִבְרֵי תּוֹרָה וְהֵם מַשְׁכִּימִים לִדְבָרִים בְּטֵלִים. אָנוּ עֲמֵלִים וְהֵם עֲמֵלִים. אָנו עֲמֵלִים וּמְקַבְּלִים שָׂכָר וְהֵם עֲמֵלִים וְאֵינָם מְקַבְּלִים שָׂכָר. אָנוּ רָצִים וְהֵם רָצִים. אָנוּ רָצִים לְחַיֵּי הָעוֹלָם הַבָּא, וְהֵם רָצִים לִבְאֵר שַׁחַת. שֶׁנֱאמַר: וְאַתָּה אֱלֹהִים תּוֹרִדֵם לִבְאֵר שַׁחַת אַנְשֵׁי דָמִים וּמִרְמָה לֹא יֶחֱצוּ יְמֵיהֶם וַאֲנִי אֶבְטַח בָּךְ:",
      "ref": "Hadran 4"
    },
    {
      "commentary": {
        "Verses": {
          "comments": [
            {
              "en": "When you walk it will lead you;<br>When you lie down it will watch over you;<br>And when you are awake it will talk with you.",
              "he": "בְּהִתְהַלֶּכְךָ֨ <b>׀</b> תַּנְחֶ֬ה אֹתָ֗ךְ בְּֽ֭שׇׁכְבְּךָ תִּשְׁמֹ֣ר עָלֶ֑יךָ וַ֝הֲקִיצ֗וֹתָ הִ֣יא תְשִׂיחֶֽךָ׃",
              "link": "/Proverbs/6",
              "ref": "Proverbs 6:22",
              "sourceHeRef": "משלי ו:כב",
              "sourceRef": "Proverbs 6:22"
            },
            {
              "en": "For through me your days will increase,<br>And years be added to your life.",
              "he": "כִּי־בִ֭י יִרְבּ֣וּ יָמֶ֑יךָ וְיוֹסִ֥יפוּ לְּ֝ךָ֗ שְׁנ֣וֹת חַיִּֽים׃",
              "link": "/Proverbs/9",
              "ref": "Proverbs 9:11",
              "sourceHeRef": "משלי ט:יא",
              "sourceRef": "Proverbs 9:11"
            },
            {
              "en": "In her right hand is length of days,<br>In her left, riches and honor.",
              "he": "אֹ֣רֶךְ יָ֭מִים בִּֽימִינָ֑הּ בִּ֝שְׂמֹאולָ֗הּ עֹ֣שֶׁר וְכָבֽוֹד׃",
              "link": "/Proverbs/3",
              "ref": "Proverbs 3:16",
              "sourceHeRef": "משלי ג:טז",
              "sourceRef": "Proverbs 3:16"
            },
            {
              "en": "May the L<small>ORD</small> grant strength to His people;<br>may the L<small>ORD</small> bestow on His people wellbeing.",
              "he": "יְֽהֹוָ֗ה עֹ֭ז לְעַמּ֣וֹ יִתֵּ֑ן יְהֹוָ֓ה <b>׀</b> יְבָרֵ֖ךְ אֶת־עַמּ֣וֹ בַשָּׁלֽוֹם׃ <span class=\"mam-spi-pe\">{פ}</span><br>",
              "link": "/Psalms/29",
              "ref": "Psalms 29:11",
              "sourceHeRef": "תהילים כט:יא",
              "sourceRef": "Psalms 29:11"
            }
          ]
        }
      },
      "en": "May it be your will, Lord my G-d, just as You have helped me to complete tractate _____, so too may you help me to start other tractates and books, and to complete them, to learn and to teach, to observe and to enact and to fulfill all the words of the teaching of your Torah with love. And may the merit of all of the Tannaim and Amoraim and Torah scholars be present for me and for my descendants, to ensure that the Torah does not depart from my mouth and from the mouths of my descendants for all eternity. And may the following be fulfilled for me: (Proverbs 6:22) \"When you walk, it will lead you, when you lie down, it will watch over you. When you awake, it will speak with you.\" (Proverbs 9:11) \"For through me your days will be multiplied, and the years of your life will be increased.\" (Proverbs 3:16) \"Length of days is in her right hand; in her left, riches and honor.\" (Psalms 29:11) \"G-d will give strength to his nation, G-d will bless his nation with peace.\"",
      "he": "יְהִי רָצוֹן מִלְּפָנֶיךָ יְיָ אֱלֹהַי, כְּשֵׁם שֶׁעֲזַרֽתַּנִי לְסַיֵים מַסֶּכֶת <small>(יאמר שם המסכת)</small>, כֵּן תּֽעַזְרֵנִי לְהַתְחִיל מַסֶּכְתּוֹת וּסֽפָרִים אַחֵרִים וּלְסַיֵימָם, לִלְמֹד וּלְלַמֵּד, לִשְׁמֹר וְלַעֲשׂוֹת וּלְקַיֵּם אֶת כָּל דִּבְרֵי תַלְמוּד תּוֹרָתֶךָ בְּאַהֲבָה, וּזְכוּת כָּל הַתַּנָּאִים וַאַמוֹרָאִים וּתַלְמִידֵי חֲכָמִים יַעֲמוֹד לִי וּלְזַרְעִי שֶׁלֹא תָּמוּש הַתּוֹרָה מִפִּי וּמִפִּי זַרְעִי עַד עוֹלָם. וַיִתְקַיֵים בִּי: בְּהִתְהַלֶּכְךָ תַּנְחֶה אֹתָךְ בְּשָׁכְבְּךָ תִּשְׁמֹר עָלֶיךָ וַהֲקִיצוֹתָ הִיא תְשִׂיחֶךָ. כִּי בִי יִרְבּוּ יָמֶיךָ וְיוֹסִיפוּ לְּךָ שְׁנוֹת חַיִּים. אֹרֶךְ יָמִים בִּימִינָהּ בִּשְׂמֹאולָהּ עֹשֶׁר וְכָבוֹד. יְיָ עֹז לְעַמּוֹ יִתֵּן יְיָ יְבָרֵךְ אֶת עַמּוֹ בַשָּׁלוֹם:",
      "ref": "Hadran 5"
    },
    {
      "commentary": {},
      "en": "May your great name be made holier and greater, in this world that he is destined to renew and to give life to the dead and raise them to eternal life,  to build the city of Yerushalayim, and complete the Beis HaMikdosh in its midst.   And to uproot idol worship from the Land, return the service of the Heaven to its place, and the Holy One Blessed Be He shall rule in his majesty and splendor in our lives, and in the lifetime of the entire household of Israel, swiftly and in the near future; and say, Amen. May his great name be blessed, forever and ever. Blessed, praised, glorified, exalted, extolled, honored elevated and lauded be the Name of the holy one, Blessed is he- above and beyond any blessings and hymns, Praises and consolations which are uttered in the world; and say Amen. May there be abundant peace from Heaven, and life, upon us and upon all Israel; and say, Amen.",
      "he": "יִתְגַּדַּל וְיִתְקַדַּשׁ שְׁמֵהּ רַבָּא. בְּעָלְמָא דִּי הוּא עָתִיד לְאִתְחַדְתָּא. וּלְאַחֲיָאה מֵתַיָּא. וּלְאַסָּקָא יַתְּהוֹן לְחַיֵּי עָלְמָא. וּלְמִבְנָא קַרְתָּא דִּי יְרוּשְלֵם. וּלְשַׁכְלְלָא הֵיכָלֵהּ בְּגַוָּהּ. וּלְמֶעֱקַר פּוּלְחָנָא נוּכְרָאָה מִן אַרְעָה. וּלְאָתָבָא פּוּלְחָנָא דִּי שְׁמַיָּא לְאַתְרָהּ. וְיַמְלִיך קוּדְשָׁא בְּרִיךְ הוּא בּמַלְכוּתֵה וִיקָרֵהּ. בְּחַיֵּיכוֹן וּבְיוֹמֵיכוֹן וּבְחַיֵּי דְכָל בֵּית יִשְׂרָאֵל, בַּעֲגָלָא וּבִזְמַן קָרִיב. וְאִמְרוּ אָמֵן. יְהֵא שְׁמֵהּ רַבָּא מְבָרַךְ לְעָלַם וּלְעָלְמֵי עָלְמַיָּא. יִתְבָּרַךְ וְיִשְׁתַּבַּח וְיִתְפָּאַר וְיִתְרוֹמַם וְיִתְנַשֵּׂא וְיִתְהַדָּר וְיִתְעַלֶּה וְיִתְהַלָּל שְׁמֵהּ דְּקֻדְשָׁא. בְּרִיךְ הוּא. לְעֵלָּא (<small>בעשי\"ת</small> לְעֵלָּא לְעֵלָּא מִכָּל) מִן כָּל בִּרְכָתָא וְשִׁירָתָא תֻּשְׁבְּחָתָא וְנֶחֱמָתָא דַּאֲמִירָן בְּעָלְמָא. וְאִמְרוּ אָמֵן. <small>[עַל יִשְׂרָאֵל וְעַל רַבָּנָן וְעַל תַּלְמִידֵיהוֹן וְעַל כָּל תַּלְמִידֵי תַלְמִידֵיהוֹן וְעַל כָּל מַאן דְּעָסְקִין בְּאוֹרַיְתָא דִּי בְאַתְרָא [בא\"י: קַדִּישָׁא] הָדֵין וְדִי בְכָל אֲתַר וַאֲתַר. יִהֵא לְהוֹן וּלְכוֹן שְׁלָמָא רַבָּא חִנָּא וְחִסְדָּא וְרַחֲמֵי וְחַיֵּי אֲרִיכֵי וּמְזוֹנֵי רְוִיחֵי וּפֻרְקָנָא מִן קֳדָם אֲבוּהוֹן דִּי בִשְׁמַיָא (וְאַרְעָא) וְאִמְרוּ אָמֵן:]</small> יְהֵא שְׁלָמָא רַבָּא מִן שְׁמַיָּא וְחַיִּים עָלֵינוּ וְעַל כָּל יִשְׂרָאֵל. וְאִמְרוּ אָמֵן: עוֹשֶׂה שָׁלוֹם (<small>בעשי\"ת</small> הַשָּׁלוֹם) בִּמְרוֹמָיו הוּא יַעֲשֶׂה שָׁלוֹם עָלֵינוּ וְעַל כָּל יִשְׂרָאֵל וְאִמְרוּ אָמֵן:",
      "ref": "Hadran 6"
    }
  ],
  "title": "Hadran",
  "titleHebrew": "הדרן"
}
